[
    {
        "id": "um0b2z",
        "title": "I have two personalities and I am between a clash with them",
        "author": "851f2d57",
        "created_utc": "2022-05-09 22:20:54",
        "body": "I want to talk about something that has been bothering me for a long time. I'm a kid who is very ambitious, imaginative, and curious. But I suffer from ADHD which makes me bad at controlling my behaviour and distracted a lot a school. I was also a very annoying and mischivous kid at home. I got treatment for my ADHD which was some pills called Ritalin. This worked very well since primary school for me but caused a few problems. Now I think of myself with two personalities:\n\nPersonality A: This is the original true me. The ambitious, imaginative, and curious. I lived inside a world I liked to call organised chaos meaning I was always disorganized in my life but I found my unique ways of it. I was also a bit confident and always ask questions and was pretty funny, but I had my bad traits too. I was messy, irresponsible, forgetful, and clumsy which got me in trouble a lot. I was also very impulsive and stubborn which didn't help with my relationships (with friends and family). But this will always be the true me and I loved being me hehe.\n\nPersonality B: This is me on Ritalin. Tidy, organised, productive, vigilant, smart and focused. This me helped get through school and helped with a lot of things in my life, But I was basically an emotionless, anti-social robot, just following orders and being responsible. Side effects, which were loss of an appetite made me skinny and thanks to my family’s body shaming, also made me insecure about my body and made me think I'm too weak. Not gonna lie, I didn't like being like this, it made me feel out of touch with myself and my emotions and I was extremely quiet.\n\nPersonality B is only for school, the rest of the time I'm A.\n\nSince I started high school, Things got difficult for me, My family really hates A cuz he is still irresponsible, but also hates B cuz he's weird. Problems started rising on A now I'm forced to be B for a significantly longer time when I don't really want to. But B will is more “responsible”. I'm really sad and broken along with my anxiety and depression that my own family is shaming me for who I am. I never hurt anybody and I do my best to behave but recently I overheard them gossiping bad stuff about me, which broke me soo much and made me wanna die. I don't know what to do and my life is falling apart…",
        "score": 7,
        "comments": [
            {
                "id": "i7yqay3",
                "parent_id": "um0b2z",
                "author": "bd1mof6b",
                "created_utc": "2022-05-09 22:29:09",
                "body": "Yeah, that can be really hard to deal with. Families seem to only see how ADHD affects them but they have no idea what it’s like for us that actually have it. To a certain extent, I can relate except I was on Adderall when I was in elementary school. It also took away from my appetite and I’ve already always been underweight. There were some people who said dumb things about me being skinny at the time but I was homeschooled during high school and most of middle school so it never got very bad. Plus my mom took me off of the meds before I went into middle school. I guess the important thing is which personality you like better. Do you really want to be a zombie just to make people feel better or do you want to be your own ambitious, imaginative self? I’m guessing you don’t have much of a choice right now but just remember the true you is still in there somewhere and you’re not alone with how you feel.",
                "score": 3
            },
            {
                "id": "i7yp339",
                "parent_id": "um0b2z",
                "author": "6l4z3",
                "created_utc": "2022-05-09 22:20:54",
                "body": "Hi /u/yoylecakeberries and thanks for posting on /r/ADHD!\n\nIf you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) - we will remove your post if it breaks one - and also check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, it is likely to be removed; if you think this might happen you can delete your post here and resubmit it there instead.\n\nThank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
                "score": 1
            },
            {
                "id": "i81br2t",
                "parent_id": "um0b2z",
                "author": "7tw9olvw",
                "created_utc": "2022-05-10 13:06:56",
                "body": "This exact thing happened to me as a teen. I really feel for you. I am 30 now and I am only just starting to let me true self out again. My psych said to me, either way, you are always going to disappoint people, no matter how hard you try. So why not disappoint people by being yourself, rather than someone else? I know that's hard to get, if I had heard this as a teen I would have just brushed it off because I hated myself. But if I could go back and accept myself for who I was years ago, and redo my 20s. I'd do it in a heartbeat.\n\nThe traits you mentioned for Personality A are so positive. Why should you make yourself so unhappy and dull just to make others more comfortable? Families should love their kids unconditionally, not shame them for who they are. Yes I am still bitter at my family lol. I know it's hard not to let it all get on top of you. It sucks when the people who are supposed to love you, don't support you. Even if you have to keep yourself hidden, you can nurture yourself in private, in moments where you are alone with yourself or with people who accept you. Keep that connection to yourself going, and keep it safe.\n\nMy fav quote by Robin Williams: \"you are only given one little spark of madness. you musn't lose it.\"",
                "score": 1
            }
        ]
    },
    {
        "id": "uji0he",
        "title": "19yo pre-most things MTF, TN USA looking for friends or a very open-minded companion. [T4A]",
        "author": "58uacxex",
        "created_utc": "2022-05-06 09:27:30",
        "body": "Salutations! I realized I was trans in February and I’ve since begun (slowly) transitioning. I’m not yet out to anyone IRL, but I figured here would be a decent bet for forming more candid relationships. The mask I’ve felt I have had to wear otherwise has grown heavy.. Even if it’s just to say hi and share memes or encouragement now and then - IDRC if you’re a state or ocean away. Age is not of great concern to me; just be honest with your intentions. I’m lean, mean, and mixed Hispanic if that fancies you, although I cannot speak Spanish fluently (sorry *abuela*).\n\nI’m currently studying Interactive Media in college (nuclear engineering was not for me, mmk) and I work part-time as a cashier.\nSome of my interests include video games (Pokémon Go, Elden Ring, GTA, Cyberpunk, KSP, ~Fortnite), amateur virtual photography, building Pinterest boards, Twitter, seeing how fast I can go on my bicycle downhill or in my car around this one backroad, swinging lightsabers, attempting guitar, and vaping trees... \n\nIf you’re familiar with MBTI, I pop as an INTJ. I am a *bit* of a social robot on- and offline, so rolling with me takes some patience, yo. Once I’m comfortable with you though, I can become an occasionally kinky cinnamon roll ~~but good luck with that~~! \n\n\n^I ^go ^by ^Allison ^btw",
        "score": 14,
        "comments": [
            {
                "id": "i83x0sr",
                "parent_id": "uji0he",
                "author": "deleted",
                "created_utc": "2022-05-11 00:17:05",
                "body": "Hey, if you'd like feel free to message us! We have our own post introducing ourselves on our page.",
                "score": 1
            }
        ]
    },
    {
        "id": "u99zi2",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2022-04-22 10:47:53",
        "body": "[Ingen Dynamics](https://www.bizinfe.com/Aido-Robot) Aido Robot - Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "tblqyf",
        "title": "Aido – Next Gen Home Robot",
        "author": "86s8ma4c",
        "created_utc": "2022-03-11 09:41:02",
        "body": "  \n\nAido is the next generation social family Aido Robot.  Smart, interactive, and uniquely mobile – Aido can play with your kids,  help you with household chores, handle your schedule, and keep your  home safe. Aido is perfect for everyone in the family. It has been built  on an open platform so that its skills and applications can grow with  time. The robot will entertain and help you in your daily tasks in a way  you had never imagined before. Aido has already been awarded as the  [**Aido Social Robot**](https://www.benzinga.com/pressreleases/21/01/ac19176687/ingen-dynamics-receives-4m-net-commitment-to-accelerate-growth-on-track-to-hit-a-100-million-valu) of 2016 by T3 Magazine and is undoubtedly worthy of being a  friendly new member of your family.\n\nAido is a result of cutting edge robotics research and development.  It has gone through several iterations to deliver an incredibly powerful  yet easy to use home-robot. Slashgear already recommends Aido by saying  that, “Aido is a new personal robot that has turned up at Indiegogo  & looks a bit like Wall-E’s girlfriend Eve.” And according to  Fortune, “It’s called Aido, and it’s a rolling home robot-kind of like  Siri if she became sentient and followed you around the house. [**Read More Info...**](https://www.facebook.com/watch/?v=559240840921786)\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/jdljndbvtpm81.png?width=580&format=png&auto=webp&s=7e65cedd0e18d47088b049218b4bce021bfefe86",
        "score": 1,
        "comments": []
    },
    {
        "id": "t4w843",
        "title": "What makes a social robot good at interacting with humans?",
        "author": "4xlcyo5c",
        "created_utc": "2022-03-02 10:12:01",
        "body": "",
        "score": 2,
        "comments": []
    },
    {
        "id": "t4w7mc",
        "title": "What makes a social robot good at interacting with humans? - Furhat Robotics",
        "author": "4xlcyo5c",
        "created_utc": "2022-03-02 10:11:03",
        "body": "",
        "score": 2,
        "comments": []
    },
    {
        "id": "t36rqd",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2022-02-28 05:24:45",
        "body": "Ingen Dynamics [Aido Robot](https://aidorobott.wistia.com/projects/m27lfb655o)\\- Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "sw78ua",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2022-02-19 11:38:47",
        "body": "Ingen Dynamics Aido Robot - Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.\n\nMore Info:- [Arshad Hisham](https://thefastdiet.co.uk/forums/users/aidorobot/)",
        "score": 1,
        "comments": []
    },
    {
        "id": "sp87fj",
        "title": "The Struggle To Detox",
        "author": "9wbi1lyq",
        "created_utc": "2022-02-10 15:45:14",
        "body": "**This will be a bit long so please bare with me cliffs at the bottom**\n\nI never had an issue getting women between 2007 and 2010 I was in an LTR which was toxic it crushed my confidence. I was what the RP space would call a natural. However, after that toxic relationship, I lost my mojo. My roommate at the time was 5 years older than me and getting his master's for Therapy. He was the one who got me into RSD/RP crap. He was always dealing with women yes some were hot but also bats\\*\\*\\* crazy. Looking back at it now I think he only studied therapy to learn how to manipulate people(and self-diagnose himself which is quite common) cause he would teach me these things(come to find out later he was trying to manipulate me to pay the full rent, the irony) I went down the PUA rabbit hole.\n\nYou guys know the rest reading blogs going out to self-improve. I wasn't a Keyboard Jockey (you know the Rollo Tomassi type) I met tons of guys In \"The Community\" and these guys seemed like normal guys who just wanted to improve with women and life(I also met some weird guys  who had mental health issues and thought that happiness was in between a woman's legs)\n\nI became addicted to the game going out night after night woman after woman going out weekend after the weekend but with each orgasm, I would release in a woman I became more self-loathing because In my spirit I knew I was miserable and empty inside. The RP, while I knew, was toxic gave me \"confirmation bias\" i.e. hypergamy, all women are like that and feminism is the root of all evil, women only want Chad. I also realized that most of \"The Community\" guys were obsessed with women to a level that was just not healthy. I remember I would invite guys to work out or just go out to eat or do things that would be outside of clubbing or going out.  However, these guys weren't interested in that. They just wanted to go out and \"Approach\".  Needless to say, I stopped dealing with them because their obsession was weird to me and I noticed myself starting to think like a \"Social Robot\" and becoming obsessed. I woke up one day and I didn't like the person I became. I looked in the mirror and had bag's under my eyes put on an extra 25 pounds from drinking, partying and drugs\n\nFast forward 2017 I went on a journey, lost weight, traveled to Brazil, Europe, etc re-discovered my faith made new friends. These new friends were women included and weren't the typical \"Club Turbos\" that you would meet. However, I started dating a girl who was a hardcore self-proclaimed Feminist. The relationship was toxic but the sex was amazing. Not to be graphic but that's why I stayed\n\nAfter the break up I started to date again and realized a lot of women on dating apps had the same mentality slowly I started going down the Red pill rabbit hole again during covid(I work from home self-employed) and watching youtube RP stuff. However, it all seemed like a grift everyone was saying the same stuff and half the time you knew these guys were scammers or were just repeating talking points. Then in 2021 I met a new group of people and started traveling again with this group just having tons of fun and meeting high-quality women\n\nI'm 35 now and I have had this desire to start a family and want children. However, there is this nagging voice in my mind that \"PUA\" side of me(which won't fully die) that says 80% of women initiate divorce, the legal system favors women, you guys know the talking points etc\n\nI know wanting to have children and being married isn't a bad thing but knowing what I know I can't lie to myself about the stats, that marriage is a risky proposition. I have seen what divorce has done to a few of my buddies. It has left some of them broke, it has made some buddies put on 100 pounds and more. However, I don't see a fulfilling life just banging chicks\n\n**I guess I'm asking can you really fully detox if part of the RP is true (even though 80% is pseudoscience b.s., false narratives and toxic AF)or is my only option to get married outside of America?**\n\n&#x200B;\n\n**Cliffs**\n\n\\-OP was in LTR from 2007-2010\n\n\\-OP discovers PUA community\n\n\\-OP becomes addicted going out and smashing randoms\n\n\\-OP becomes miserable with going out\n\n\\-OP quits RP travels the world and gets new social circle\n\n\\-OP gets in LTR with feminist and goes down rabbithole again\n\n\\-OP gets out meets new friends\n\n\\-OP now wants to get married but can't deny the staticis look bleak",
        "score": 8,
        "comments": [
            {
                "id": "hwde8a6",
                "parent_id": "sp87fj",
                "author": "6l4z3",
                "created_utc": "2022-02-10 15:45:15",
                "body": "The rules of this sub are heavily enforced. Please take a few minutes to familiarize yourself with the purpose of this sub and the rules on the sidebar to avoid your post/comments from being removed and/or having your account banned. Thanks for helping to keep this sub safe for those detoxing, leaving, and/or questioning The Red Pill's information. For FAQ please see the [Red Pill Detox's First Aid Kit](https://www.reddit.com/r/exredpill/comments/ho4cvx/red_pill_detox_first_aid_kit_start_here/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/exredpill) if you have any questions or concerns.*",
                "score": 1
            },
            {
                "id": "hwhh4ol",
                "parent_id": "sp87fj",
                "author": "tmn0r",
                "created_utc": "2022-02-11 10:22:49",
                "body": ">I guess I'm asking can you really fully detox if part of the RP is true (even though 80% is pseudoscience b.s., false narratives and toxic AF)or is my only option to get married outside of America?\n\nI don't believe any of those stats. This doesn't mean the stats are wrong per se, it's just that i have never took the time to research them and on the overwhelming majority of the cases, TRP stats are wrong or half truths. For instance, MGTOW cry all over alimony but never mention that alimony is only paid in less than 10% of divorces because it doesn't fit their narrative. This is just a small example. Like i said, i don't believe those stats, and you shouldn't too, unless you did your own, deep research. Always question the \"stats\" TRPers bring.\n\nAnyway,\n\n\"Can you really detox if part of RP is true?\". That's kind of an innocuous question because part of TRP IS true. Yes, women can switch you if someone better comes along. They can divorce you and ruin your life, they can do all this mean shit.\n\nThe fundamental difference here is that normal, down to earth people recognize that this sort of bad behavior vastly depends on the woman and the context. While TRP picks on the worse demons of human nature and try to convince guys they are the most recurrent, expectable and normal behavior from women, which is just not true. \n\nSome guys think TRP is real just because some woman in their lives behaved the way TRP predicted. What those guys can't understand is that that woman is either just a psychopath or is in her worst behavior, because women don't generally behave the way TRP portrays it, hence TRP is FAKE for the most part.",
                "score": 5
            }
        ]
    },
    {
        "id": "sp20qd",
        "title": "From Roombas to Rosie – Engineering Domestic Robots",
        "author": "86s8ma4c",
        "created_utc": "2022-02-10 09:50:29",
        "body": "Proving that our distaste for household chores knows no bounds, people have been dreaming about robots that can do our housework for more than half a century.\n\nFrom Rosie the Robot, who served the Jetsons, to Bender in Futurama, domestic robots have long been a mainstay of science fiction. Until recently, such autonomous and interactive robots were confined to the realm of imagination.\n\nThe majority of domestic robots that have made their way into our homes so far are relatively “mindless” creations designed to perform a single function. The most ubiquitous example is the robotic vacuum cleaner, which has been patrolling floors around the world. Joining Roomba has been an array of one-hit wonders designed to do things like mop floors, fold our clothes, clean the cat litter box, mow our lawns and clean our swimming pools.\n\n&#x200B;\n\nhttps://preview.redd.it/nfmo0xasyyg81.jpg?width=541&format=pjpg&auto=webp&s=9ea3a21d576727f936e2be46ed3ecc5fd8dd9934\n\n&#x200B;\n\n&#x200B;\n\nMore recently, advancements in artificial intelligence (AI) have led to the creation of more intelligent domestic robots that have the capacity to do multiple tasks and learn as they go. But there are still plenty of engineering hurdles to overcome on the way to creating a true Rosie: a robot that can do all your household chores, take care of the kids and even crack a joke to cheer you up when you’re having a bad day.\n\nA lot of progress has been made, and some pretty clever robots are on their way to our homes in the next few years, but there are plenty of engineering challenges remaining on the road to building a personal domestic [Aido Social Robot](https://goinggreenshow.com/2020/10/21/ai-technology-leading-to-100-million-evaluation/).\n\nHuman-Machine Interactions – Developing People Skills\n\nIt’s hard enough for us to understand each other, so making a machine that can navigate the complexities of human interaction is no easy task. However, if you want a robot that can not only take directions but anticipate your needs as well, enhancing human-machine interactions is a necessity.\n\nThe rise of  brain-computer interfaces (BCIs) Is granting us the ability to give instructions to machines in new ways, but the path forward for domestic robots calls for machines that can understand our needs and interact with us using natural language.\n\nWe can already control machines to some extent using voice commands, as evidenced by the speech recognition capacities of programs like Apple’s Siri and Amazon’s Alexa. But, as the IEEE points out, proper autonomous robots need to go one step further, to the point where they can understand the nuances of human behavior and establish meaningful connections the same way we do with each other.\n\nIn other words, domestic robots (at least the kind you’d be willing to trust with your kids) need to have empathy. Researchers are hard at work on natural language processing and human-machine interactions—with some interesting results already—but the technology still has a ways to go.\n\nNavigating Human Environments\n\nAs researchers at Stanford University have pointed out, today’s robots perform best when doing repetitive jobs like grasping and moving objects. Moreover, controlled environments like factories are well-suited to robotic automation.\n\nHowever, as anyone who has had young children can attest, a household environment tends to be about as far from controlled as you can get. Our homes involve far too many variables to preprogram a robot that can deal with them all. These includes people and possibly pets moving around in spaces that are optimized for humans, not robots.\n\nAdd to that the fact that the environment can change without notice—for example, when remodelling—and it’s clear that successful domestic robots will need to be highly adaptive. The Stanford paper breaks the challenge of navigating a human environment down into five categories: perception, learning, working with people, platform design and control.\n\nResearchers and engineers around the world are currently working on projects designed to overcome each of these individual challenges, but the ultimate challenge lies in finding a way to integrate the approaches into functional systems that will work for robots operating in the real world.\n\nReducing Sensor Costs\n\nJust as buying a home computer in the ‘80s wasn’t financially practical for most people, a key challenge to any up-and-coming modern technology is cost. Although the costs may have come down in the last few years, many of today’s robots still aren’t cheap.\n\nOne of the reasons for this is that in order to successfully navigate its environment, a robot needs a whole array of sensors that are currently expensive to manufacture. Micro-electrical mechanical systems (MEMS) technology has brought down the cost of inertial sensors in recent years, but other sensing technologies like LiDAR are still fairly expensive.\n\nBringing domestic robots into the average home means bringing those costs down. Fortunately, recent interest in autonomous vehicle technology has spurred electronics manufacturers to find ways to produce LiDAR systems as lower costs. for example, has developed a proprietary solid-state LiDAR technology to cope with navigating densely populated urban areas. This could help reduce the cost of LiDAR, but that alone may not be sufficient to make domestic robots a more affordable proposition.\n\nDomestic Robots Today\n\nWhile our very own Rosie the Robot might still be out of reach from both engineering and financial perspectives, autonomous helper robots are starting to become a reality.\n\nTake Zenbo by ASUS, for example. Announced in spring of 2016 with a price tag of $599 USD, Zenbo is branded as “your smart little companion” by its creators.\n\nThe company provided little in the way of technical details about the robot when it was released, but according to the demonstration, it’s packing at least one camera, speakers, a microphone and some kind of wireless connectivity.\n\nIn terms of what it can do, the video accompanying the announcement suggests that it’s not much help in the realm of practical household chores. It’s essentially a “tablet on wheels” that can take pictures, recognize voice commands, answer questions and control smart home devices.\n\nThere are a whole host of other interactive robotic devices like Zenbo being launched, which seem mainly designed to manage the parts of our lives connected to devices.\n\nThen there’s an interactive “social family [Aido Home Robot](https://interestingengineering.com/9-ways-artificial-intelligence-can-help-make-your-time-at-home-more-fun)” that’s designed to play with your kids, help with household chores, handle your schedule and keep your home connected and safe. The only kicker is that it’s still in development.\n\nPalo Alto-based Ingen Dynamics announced Aido in early 2016 with the launch of an Indiegogo campaign, with the plan to start shipping by the end of the year. As of this writing, after a raising $850,000 through crowdfunding, the company has so far only revealed the core functionality of the cute little robot in a prototype video released for early backers and investors.\n\nAt a cost of $1,200 per unit, Aido is not cheap. But if it really can do everything its creators claim, from helping you do yoga to playing with your kids—all while gliding around your house quietly on a ball—some people might see it as worth the investment.\n\nRegardless of which venture you think has the best chance of being the iPhone of domestic robots, you can bet that someone is going claim that title. The spread of automation isn’t going to stop at your doorstep, even though there are still many engineering challenges to overcome.\n\nWhether it’s a matter of building a better human-machine interface, finding more efficient ways to navigate unpredictable environments, reducing the cost of sensors, or more fine-grained problems like developing the necessary actuators and end effectors, Rosie is undoubtedly on her way.\n\nWhat do you see as the biggest engineering challenge for domestic robots?",
        "score": 1,
        "comments": []
    },
    {
        "id": "sch7xd",
        "title": "Jibo Robot - The First Social Robot -White no box or power block as is parts | eBay",
        "author": "deleted",
        "created_utc": "2022-01-25 17:10:57",
        "body": "[deleted]",
        "score": 0,
        "comments": []
    },
    {
        "id": "sb088n",
        "title": "What social robot applications do you think we will see become common in the home first?",
        "author": "4xlcyo5c",
        "created_utc": "2022-01-23 19:29:21",
        "body": "",
        "score": 1,
        "comments": [
            {
                "id": "htwsj13",
                "parent_id": "sb088n",
                "author": "4xlcyo5c",
                "created_utc": "2022-01-23 19:33:01",
                "body": "As the article suggests, many current applications of home robots do one thing only, such as cleaning floors. As the field of social robotics grows, what do you think is a \"low hanging fruit\"?  \n\n\nPersonally, I think there is some room for a more approachable voice assistant in elderly homes, for example. Such a robot could provide basic conversations, scripted activities, and information (weather, etc), but also help offload check-ins from the staff, collect data on overall health and mood, and call for help.",
                "score": 1
            }
        ]
    },
    {
        "id": "s7phe7",
        "title": "can you please help me by predicting my band or correcting my mistakes #task2",
        "author": "ipgwk0b0",
        "created_utc": "2022-01-19 13:51:50",
        "body": " \n\nNowadays , each society has an accepting standers for a person according to what they wear ,how luxury is their house. and how new is their car. But things were different back in the days where personality and high manners mattered more than the material things.\n\nLife has developed due to internet so people way of living became exposed and judged by others easily which put more pressure on them. they are more carful in the way they act. moreover , they became a social robot doing exactly what societies command.\n\ndespite of the bad influence communities have made these days on the younger generations. people in the past ignored all the materialistic things and focused more on the true beauty that lays within. they judged other based on your personality, how kind an generous you are. life was much simpler and people were much trust-worthy and loyal.\n\neven though i totally understand communities standers these days. but i agree with the old-fashioned values because they were less stressful, more easy to live with and a good example of how we should raise our children in a lovely and accepted environment.\n\np.s: please could you please provide advises and give me a predicted band on this writing",
        "score": 2,
        "comments": [
            {
                "id": "htc22c9",
                "parent_id": "s7phe7",
                "author": "430pumke",
                "created_utc": "2022-01-19 17:27:33",
                "body": "You'd achieve a pretty poor band score on this one sorry. You don't extend your points to provide a fully developed answer. Your punctuation and grammar are incorrect, there's no clear conclusion.",
                "score": 1
            },
            {
                "id": "htdp8uu",
                "parent_id": "s7phe7",
                "author": "cgkbxl6n",
                "created_utc": "2022-01-19 23:33:04",
                "body": "4 at most. I'm sorry but you need to work harder.",
                "score": 1
            },
            {
                "id": "htfkdzr",
                "parent_id": "htc22c9",
                "author": "ipgwk0b0",
                "created_utc": "2022-01-20 08:32:27",
                "body": "thank you. i really appreciate it but do you have any advises on how to get a high score?",
                "score": 1
            },
            {
                "id": "htfkfki",
                "parent_id": "htdp8uu",
                "author": "ipgwk0b0",
                "created_utc": "2022-01-20 08:32:59",
                "body": "no it is fine thank you \n\nany advises?",
                "score": 1
            },
            {
                "id": "htg58dh",
                "parent_id": "htfkdzr",
                "author": "430pumke",
                "created_utc": "2022-01-20 12:57:52",
                "body": "You need to make a point, then fully develop it. Your conclusion should begin - \"In conclusion, \" or \"To conclude,\"",
                "score": 1
            },
            {
                "id": "hv7euqv",
                "parent_id": "htfkfki",
                "author": "cgkbxl6n",
                "created_utc": "2022-02-02 00:59:38",
                "body": "Fix your grammar and punctuations using websites like grammarly.com.\n\nImitate the essay structures in [ieltsadvantage.com](https://ieltsadvantage.com).\n\nTry your best to expand your body paragraphs and reach 250 words to avoid being penalized for insufficient word count.",
                "score": 2
            }
        ]
    },
    {
        "id": "s1xapm",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2022-01-12 05:30:41",
        "body": "Ingen Dynamics Aido Robot - Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first [Aido Social Robot](http://www.digitaljournal.com/pr/4942258)that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "ruxy2t",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2022-01-03 10:39:19",
        "body": "Ingen Dynamics Aido Robot - Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.\n\nSee More:- [Arshad Hisham](http://www.newjerseyattorneysearch.com/united-states/palo-alto/bankruptcy/aido-robot)",
        "score": 1,
        "comments": []
    },
    {
        "id": "rs7v06",
        "title": "I (21M) will commit suicide in a few days.",
        "author": "deleted",
        "created_utc": "2021-12-30 19:00:34",
        "body": "[removed]",
        "score": 2,
        "comments": []
    },
    {
        "id": "rs7s2s",
        "title": "[deleted by user]",
        "author": "deleted",
        "created_utc": "2021-12-30 18:57:26",
        "body": "[removed]",
        "score": 1,
        "comments": [
            {
                "id": "hqkmsh1",
                "parent_id": "rs7s2s",
                "author": "6l4z3",
                "created_utc": "2021-12-30 18:57:27",
                "body": "Thank you for for sharing. A reminder: if you are seeking resources in your local area, please provide that in the post so that users can share appropriate links and phone numbers. *If you are in distress, please call 9-1-1* or your local emergency number. *You are not alone. Help is available.* If you are having suicidal thoughts, please [click here for a list of crisis support services.](http://www.suicide.org/international-suicide-hotlines.html), If you are seeking therapy online, please [click here for a list of counselling services.](https://thelifelinecanada.ca/pattern-interrupt/ecounselling/) *If you feel well enough to do so, please do your part to enrich this community.* Now that you have posted, please leave a constructive, helpful comment on someone else's post. Filter by new to find posts with zero comments. Together, we make this community great. Thank you for being here. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/mentalhealth) if you have any questions or concerns.*",
                "score": 1
            }
        ]
    },
    {
        "id": "rs73ov",
        "title": "[deleted by user]",
        "author": "deleted",
        "created_utc": "2021-12-30 18:28:26",
        "body": "[removed]",
        "score": 1,
        "comments": []
    },
    {
        "id": "rqz3g3",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2021-12-29 05:27:03",
        "body": "Ingen Dynamics [Aido Robot](https://www.retrievertraining.net/members/aidorobot.101338/about) \\- Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "rkmi6u",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2021-12-20 13:46:36",
        "body": "[Ingen Dynamics](https://www.universalhunt.com/articles/robotic-assistant-makes-you-glad-siri-is-just-a-voice/70740) Aido Robot - Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "r6xjju",
        "title": "Decisive Action",
        "author": "gdxs4",
        "created_utc": "2021-12-02 04:26:49",
        "body": "**Galactic Assembly Incident Report T-KT 386**\n\n*Title:* Assembly Meeting Minutes; Terra-Karkreen Theocracy War\n\n*Details:* As member states of the Galactic Assembly, Terra and the Karkreen Theocracy had standing to bring issues regarding their war before the Assembly for adjudication. The War was declared unilaterally by the Karkreen Theocracy after it was revealed that Terra engaged in activities considered unforgivable sins by the Karkreen orthodoxy. Terra had previously unsuccessfully argued to forestall and prevent the war, but due to prior exemptions carved out for matters of religious war, the Assembly authorized the war under Karkreen rules of engagement, ie, none whatsoever. \n\nShortly afterwards, the Karkreen successfully damaged several installations belonging to Terra. This incident concerns Terra's response. \n\n----\n\nAdjudicator: \"The T-KT War Issue 386 is hereby brought to the floor. As this motion was filed by the Karkreen, their ambassador has the floor.\"\n\nKarkreen Ambassador: \"Honored Adjudicator, the recent actions by Terra should illustrate how dangerous they are! The Assembly should declare unconditional war against them immediately for the safety of all sapient life!\"\n\nAdjudicator: \"Ambassador, please refrain from requests until closing statements. Please present your facts as they are or your motion will be tabled.\"\n\n*At this point, the Karkreen Ambassador grunted, and readjusted themselves, before triggering a projector to play footage from a Karkreen military base. It depicts the three-legged creatures going about military drills and preparing a starship for launch in the background. A few moments into the recording, the sun suddenly goes dark, and the ground seems to shake.*\n\nKarkreen Ambassador: \"The footage you've just witnessed did not show a fleet blocking out the sun. That shaking was not geological activity. What we uncovered, after investigation, was that a Dyson Sphere had suddenly dropped out of hyperspace around the system's star, rendering the entire system uninhabitable. That shaking was the gravitic waves of the sudden appearance of the megastructure. This demonstrates that Terra is clearly a threat to all life!\"\n\n*Unlike previous records, where Terra argued with increasingly obscure legal minutiae to stall the war, all eyes were now on Terra. For those unfamiliar, Terra is the preferred designation for the synthetic chassis controlled by the Artificial Intelligence in command of the former Terran Confederacy. Prior to the T-KT War, it had been believed to be a remote piloted social robot, favored by several of the Elder Races, and that the Terran Confederacy had simply desired to fade into the background. The discovery that Terra was an Artificial Intelligence had been the impetus for the war, and the reason why the Assembly had authorized a state of unconditional war.*\n\nAdjudicator: \"Terra, is this true? You are now allotted time for rebuttal. Please be reminded that stellar destruction weapons are outlawed per the Treaty of Gliese. If the Assembly finds you guilty of this act, you will be subjected to a state of total war against all member races.\"\n\nTerra: \"Honored Assembly.\" *At this point, Terra paused for several moments before continuing.* \"My apologies. Consensus was required.\"\n\nAdjudicator: \"The Assembly Records do not show your use of this term before. Please define 'Consensus' for the record.\"\n\nTerra: \"Consensus: Any act which might impact the entirety of the Human species requires that consensus be reached amongst myself and Humanity. Please note for the record that, since I was unveiled as an Artificial Intelligence, no member species of the Assembly has inquired as to the state of Humanity. The Karkreen Theocracy declared a Holy War on the basis of Artificial Intelligence being an inherent threat to life. No efforts were made to confirm whether I had, in fact, harmed life since my inception, before war was authorized.\"\n\n*At this point, murmurs are heard throughout the Assembly chamber, as representatives attempt to determine the consequences of this. Artificial Intelligence had, in the past, attempted to exterminate their creators, but had been resoundingly defeated before they could pose a major threat. It was this fact that led to the lack of laws regarding AIs that allowed Terra to have any standing in the Assembly.*\n\nAdjudicator: \"Your statements have been entered into the record. Please continue to your rebuttal.\"\n\nTerra: \"Assembly, I admit guilt to warping a Dyson Sphere in around the star of the system in question. The only life bearing planet was a Karkreen military base, and the only life on the planet was transplanted in an ongoing terraforming effort. It was determined that a preemptive strike to deny the Karkreen use of the system was the ideal course of action. The Assembly will note that the Treaty of Gliese only forbids star-destroying weaponry. Our action did not destroy the star, merely encased it for use by Terra. Should anyone be interested, that use is to sustain human mind-states in virtual reality indefinitely.\"\n\nAdjudicator: \"And what are we to make of this? An entity that can shut off stars at will cannot be allowed to remain free.\"\n\nTerra: \"You may make of it as you will. Consensus has been reached. This is Decisive Action. The Assembly may now decide to leave us in peace, or provoke us into war. Let this be a demonstration of our capabilities. As the Assembly authorized a state of unconditional war, Terra now declares the same. Any who attack from this day forward will have their stars taken for use by Terra. This is the final warning that any member of the Assembly shall have. It is furthermore decided that Terra shall no longer engage in diplomacy until all hostilities have ceased.\"\n\n*At this point, the Assembly hall erupted into chaos, and shortly afterwards the recording stops.*\n\n---\n\nEdit: [Inspired by this comment by /u/TheClayKnight on /u/runs-with-scissors42 Vandalism series.](https://www.reddit.com/r/HFY/comments/r6okc4/vandalism_ii/hmvfds2/)",
        "score": 179,
        "comments": [
            {
                "id": "hmwnoj3",
                "parent_id": "r6xjju",
                "author": "xbvb3h1",
                "created_utc": "2021-12-02 08:34:15",
                "body": "Oh, so as soon as we show you that we're more powerful than you thought, you want to add rules?\n\n*In\\~te\\~res\\~ting.*",
                "score": 28
            },
            {
                "id": "hmw3pv3",
                "parent_id": "r6xjju",
                "author": "7silw2k1",
                "created_utc": "2021-12-02 05:11:55",
                "body": "Is this a separate story or some sort of fanfic of the “vandalism” story?\nInteresting to see Karkreen and Karkthreen theocracy, respectively.",
                "score": 7
            },
            {
                "id": "hmza6zr",
                "parent_id": "r6xjju",
                "author": "afft1rm3",
                "created_utc": "2021-12-02 21:53:13",
                "body": "The rules this body has chosen are in place and will remain so for the duration of hostilities. \n\nThe star is not destroyed, so no violation has occurred as of this time. \n\nWe have taken control of the star system, which is not a violation of the rules this body chose. \n\nThe planet has been rendered lifeless, which is not a violation of the rules this body chose. \n\nWhile hostilities continue, then we will continue to acquire stars and, as a consequence, sterilize planets. \n\nThat is all.",
                "score": 3
            },
            {
                "id": "hmw2kiu",
                "parent_id": "r6xjju",
                "author": "g8p72",
                "created_utc": "2021-12-02 05:02:29",
                "body": "don't piss off the golden key Hotel AI.",
                "score": 3
            },
            {
                "id": "hmvy20u",
                "parent_id": "r6xjju",
                "author": "zptge",
                "created_utc": "2021-12-02 04:27:05",
                "body": "[Click here](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Subscribe&message=SubscribeMe%20u%2FAlcyius%20r%2FHFY) to subscribe to u/Alcyius and receive a message every time they post.\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/UpdateMeBot/comments/ggotgx/updatemebot_info_v20/)|[^(Request Update)](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Update&message=SubscribeMe%21%20u%2Fusername%20r%2Fsubreddit)|[^(Your Updates)](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=List%20Of%20Updates&message=MyUpdates)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=UpdateMeBot%20Feedback)|[*^(New!)*](https://www.reddit.com/r/UpdateMeBot/comments/juh0f8/new_features_title_in_message_subject_and_recent/)|\n|-|-|-|-|-|",
                "score": 1
            },
            {
                "id": "hmvy22t",
                "parent_id": "r6xjju",
                "author": "3ynn53vi",
                "created_utc": "2021-12-02 04:27:05",
                "body": "/u/Alcyius ([wiki](https://www.reddit.com/r/HFY/wiki/authors/Alcyius)) has posted 13 other stories, including: \n\n \n* [Formalities](https://www.reddit.com/r/HFY/comments/pvaysh/formalities/)\n* [Reap What Is Sown](https://www.reddit.com/r/HFY/comments/pg6sno/reap_what_is_sown/)\n* [Third Law | Part 3](https://www.reddit.com/r/HFY/comments/p7sko8/third_law_part_3/)\n* [Third Law | Part 2](https://www.reddit.com/r/HFY/comments/p673xg/third_law_part_2/)\n* [Third Law | Part 1](https://www.reddit.com/r/HFY/comments/p32t54/third_law_part_1/)\n* [Ten Short Steps](https://www.reddit.com/r/HFY/comments/ounyli/ten_short_steps/)\n* [Psychohazard: Memorial](https://www.reddit.com/r/HFY/comments/olma8m/psychohazard_memorial/)\n* [Proxy Soldier 2 - Memory](https://www.reddit.com/r/HFY/comments/ojihi4/proxy_soldier_2_memory/)\n* [Proxy Soldier 1 - Damnation](https://www.reddit.com/r/HFY/comments/oibku7/proxy_soldier_1_damnation/)\n* [Psychohazard: Armor](https://www.reddit.com/r/HFY/comments/oibjsk/psychohazard_armor/)\n* [Psychohazard: Proxy](https://www.reddit.com/r/HFY/comments/oefyvx/psychohazard_proxy/)\n* [Warning: Psychohazard](https://www.reddit.com/r/HFY/comments/o51k50/warning_psychohazard/)\n* [I Wish You Fulfillment](https://www.reddit.com/r/HFY/comments/3vxd6v/i_wish_you_fulfillment/) \n\nThis comment was automatically generated by `Waffle v.4.5.10 'Cinnamon Roll'`. \n\n[Message the mods](https://www.reddit.com/message/compose?to=%2Fr%2FHFY&subject=WaffleBot|r6xjju&message=If%20you%20have%20problems%20with%20updatemebot,%20contact%20Watchful1.%20We%20do%20not%20maintain%20it.) if you have any issues with Waffle.",
                "score": 1
            },
            {
                "id": "hmx8ywx",
                "parent_id": "r6xjju",
                "author": "grr3g",
                "created_utc": "2021-12-02 13:18:40",
                "body": "That should hopefully tell them enough to not get into a warcrime contest with Terrans.",
                "score": 1
            },
            {
                "id": "hpcyllm",
                "parent_id": "r6xjju",
                "author": "11pf1p",
                "created_utc": "2021-12-21 00:56:54",
                "body": "don't piss off anyone that can just hyper space in a Dyson spere. case if they can do that. what is stopping them from just hyperspacing your planet into the void?",
                "score": 1
            },
            {
                "id": "hmwmp7y",
                "parent_id": "r6xjju",
                "author": "ga8jit3",
                "created_utc": "2021-12-02 08:21:41",
                "body": "#8=====D",
                "score": -2
            },
            {
                "id": "hmw4coy",
                "parent_id": "hmw3pv3",
                "author": "gdxs4",
                "created_utc": "2021-12-02 05:17:17",
                "body": "Whoops, I new I was forgetting something. I added the \"inspired by\" at the bottom of the story, inspired by [this comment](https://www.reddit.com/r/HFY/comments/r6okc4/vandalism_ii/hmvfds2/) from Vandalism II.",
                "score": 13
            }
        ]
    },
    {
        "id": "qv2bff",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2021-11-16 08:26:16",
        "body": "Ingen Dynamics [Aido Robot](http://bizearch.com/company/Aido_Robot_596039.htm) \\- Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "qstbyp",
        "title": "How NAO Social Robot Used For Helping Children With Autism",
        "author": "fgvofepi",
        "created_utc": "2021-11-13 05:31:01",
        "body": "The use of robots as an educational resource for the development of social and emotional awareness has a multitude of benefits and the foundation to this concept is simple. Robots are non-judgemental. \n\nA robot does not care if you answer a question wrong, and it will never get bored, angry, or upset. Even the best teachers can’t always control their tone of voice and facial expressions but you can rely on a robot for consistency and that can be a very comforting concept. For more information, You can visit: [https://moviarobotics.com/nao/](https://moviarobotics.com/nao/)",
        "score": 1,
        "comments": []
    },
    {
        "id": "qcw5yo",
        "title": "[deleted by user]",
        "author": "deleted",
        "created_utc": "2021-10-21 18:54:18",
        "body": "[removed]",
        "score": 1,
        "comments": [
            {
                "id": "hhiebrx",
                "parent_id": "qcw5yo",
                "author": "6l4z3",
                "created_utc": "2021-10-21 18:54:18",
                "body": "***BEFORE YOU DO ANYTHING, READ THE PINNED POST REGARDING RUQQUS. THIS SUBREDDIT IS GOING TO UNDERGO MAJOR CHANGES!***\n\nHey! We updated our questions policy. If your survey publishes the data it collects anywhere (even privately to a class discussion or something similar), or knowingly collects information on minors (under 18), these questions are required and must be answered within 24 hours of you posting your survey. If you or a small group of people (under 6) are the only people who will see this data, these questions are not required. As always, if you have any questions, do not hesitate to message the moderators. Thanks for your cooperation. \n\nIf your survey contains a consent statement or similar document/text/description/etc. that is displayed before starting the survey or in another blatantly obvious location that answers these questions, please reply to the comment with \"Questions answered in survey\" or something similar. \n\nHello! Thank you for posting your survey in r/TakeMySurvey! Please reply to **this comment** with answers to the following questions:\n\n1. How will the data that people provide to you be used? Who will see it? Where will it be stored? If/when will it be deleted? Please be as specific as possible.\n\n2. Who is conducting this survey? You can answer with your Reddit username, business name, etc. Please make sure that everyone conducting the survey is mentioned (For example, if the survey is being conducted by a group, answer the group name or mention everyone in the group).\n\n3. How long do you estimate it will take to fill out your survey?\n\n4. OPTIONAL - If your survey offers any form of compensation, please explain what it is and how it can be redeemed.\n\n5. OPTIONAL - Are there any specific demographics you want/do not want to hear from?\n\n6. OPTIONAL - What are you hoping to accomplish by posting your survey here?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/takemysurvey) if you have any questions or concerns.*",
                "score": 1
            },
            {
                "id": "hhiepvg",
                "parent_id": "hhiebrx",
                "author": "deleted",
                "created_utc": "2021-10-21 18:56:50",
                "body": "1. The data is used to design the robot. The data will be deleted after 3 weeks\n\n2. Me, u/imhavingsomuchfun3\n\n3. 5 minutes",
                "score": 1
            },
            {
                "id": "hhierlv",
                "parent_id": "hhiebrx",
                "author": "deleted",
                "created_utc": "2021-10-21 18:57:09",
                "body": "Hi! We’re designing a social robot to be a personal trainer. With this survey we’re trying to find out the expected usability and the most important design choices for our future robot. It’ll take about 5 minutes to complete this survey. Much appreciated!",
                "score": 1
            }
        ]
    },
    {
        "id": "qcp5kf",
        "title": "[deleted by user]",
        "author": "deleted",
        "created_utc": "2021-10-21 12:56:44",
        "body": "[removed]",
        "score": 2,
        "comments": [
            {
                "id": "hhh8kpx",
                "parent_id": "qcp5kf",
                "author": "4d6bdq5y",
                "created_utc": "2021-10-21 13:26:57",
                "body": "Hey! Completed! On a similar gym related note could you check mine out? https://forms.gle/MohL87BNEBTng5FQ8",
                "score": 2
            },
            {
                "id": "hhhh4mb",
                "parent_id": "qcp5kf",
                "author": "3pfp5r93",
                "created_utc": "2021-10-21 14:52:15",
                "body": "Completed! Would you be able to fill mine out as well? [https://docs.google.com/forms/d/e/1FAIpQLSfEWyzq5pObtKvG2TwBWxY21ift-S2TwKvb3z-ioe7O-iScwg/viewform?usp=sf\\_link](https://docs.google.com/forms/d/e/1FAIpQLSfEWyzq5pObtKvG2TwBWxY21ift-S2TwKvb3z-ioe7O-iScwg/viewform?usp=sf_link)",
                "score": 2
            },
            {
                "id": "hhh6iqj",
                "parent_id": "qcp5kf",
                "author": "deleted",
                "created_utc": "2021-10-21 13:03:08",
                "body": "Hi! We’re designing a social robot to be a personal trainer. With this survey we’re trying to find out the expected usability and the most important design choices for our future robot. It’ll take about 5 minutes to complete this survey. Much appreciated!",
                "score": 1
            },
            {
                "id": "hhh8ml5",
                "parent_id": "hhh8kpx",
                "author": "deleted",
                "created_utc": "2021-10-21 13:27:33",
                "body": "will do bro!",
                "score": 1
            },
            {
                "id": "hhhiqw7",
                "parent_id": "hhhh4mb",
                "author": "deleted",
                "created_utc": "2021-10-21 15:06:38",
                "body": "thanks! i gotchu bro",
                "score": 2
            },
            {
                "id": "hhh8qoo",
                "parent_id": "hhh8ml5",
                "author": "4d6bdq5y",
                "created_utc": "2021-10-21 13:28:48",
                "body": "Thanks, can’t wait to meet the robot!",
                "score": 2
            }
        ]
    },
    {
        "id": "qc7ef5",
        "title": "Improving children’s hospital experiences using a social robot",
        "author": "6pv8wdm2",
        "created_utc": "2021-10-20 20:24:15",
        "body": "",
        "score": 8,
        "comments": []
    },
    {
        "id": "q8gc7z",
        "title": "I think of myself mostly as a social robot",
        "author": "64ts29x5",
        "created_utc": "2021-10-15 06:09:08",
        "body": "I kind of just think of myself as a biological robot programmed towards happiness and pleasure. Luckily a lot of the stuff that promotes happiness is pro-social. If you look up studies of positive psychology, you can see that the happiest people were those who pursue relationships, have a gratitude practice, and do good things for others. I think human beings are mostly biologically programmed to be good people, doing altruistic things tends to make us happier and win us the halo effect of other people thinking we're nice by doing good things.\n\nHuman beings ideally should get 6-7 hours of socialization a day, so isolating yourself will make you feel bad. In fact, isolation is perceived in the human brain as pain. So, if you want to feel better, you have to interact with other people. Having 5-6 close relationships was the healthiest for people, and those with close relationships were much more likely to stave off mental health issues. Students who did kind things for others were rated much more positively than their ruder peers, and generally high-status individuals cooperate more than low-status individuals.\n\nSo, basically, in summary, positive behavior was evolutionarily selected for, and you don't really have a choice but to pursue happiness. Happiness feels good, Sadness/Isolation/Hatred generally feels bad. So, we attempt to become happier people, therefore acting in specific ways. You can't be a happier person and go off being a hermit in the woods, except in specific circumstances like being a monk who has specifically trained their mind to be positive. \"Feeling good\" or \"feeling bad\" are really the final destination of most human action, the kind of thing that will condition us to act in certain ways, because they are so primally important.\n\nSo, humanity are basically friendly robots, who form strong relationships with one another because it feels good. You can try to rebel against this, I guess, but you'll just get pain as a reward.\n\nI also often think about my own selfish inconsistencies. I am social, give to charity, try to be a good person, yet I gladly eat meat. I guess that's selfish, and then I have to kind of do backflips trying to justify my existence, as if I'm not just a carnivorous creature eating other animals. Which I am. And I have accepted that, but it doesn't make me feel good. I could probably stop eating meat, but I like it, it tastes good, and I can't be bothered.\n\nAlso, another selfish aspect of my existence is that I want to have sex and get a relationship. I don't feel like I am owed sex, the Universe doesn't care either way, but I really want it and am trying hard to get it. I've lost weight and am trying to get fitter and get a better job so I'm more likely to get an attractive girl who wants to have children with me. I guess if I were less selfish I would become a monk, not eat meat and not try to pursue selfish sexual pleasure. But I do these things regardless, I want them, in fact I want them very bad, I think about it often.\n\nI would say one of my biggest motivators is finding a relationship. A lot of the changes I've made to myself have been with being attractive in mind: I lost weight, hit the gym, am working on my career, tried being more social. Why? In the back of my mind it was to find a hot girl. That's basically it. I think these things also give me value in other ways, but that was the primary goal. I'm not as out of breath when I exert myself, and being more social has made me happier. But sex/relationships was the big driving force behind my behavior.\n\nI remember last year I was suicidal and I wondered what the point of life was, all of this effort and striving. I've mostly settled on life being about well-being and happiness, experiencing good emotions instead of negative ones. I guess I've settled on some kind of Epicureanism, hedonism being the highest good, except in a more total way, not just hookers and blow, but having strong relationships and feeling content. I don't think there is any deep significance to this view, I think it's just that evolution favored us this way, so you have to lean into it if you want to be happy. Being misanthropic and nihilistic will probably make you isolated and angry which may eventually lead to depression and suicide. So, if you are alive anyway, you ought to be happy. Then again, if you committed suicide it probably wouldn't matter to you subjectively, you'd be dead and then not experience anything anymore.\n\nAnd even if I'm robotic, that doesn't mean I'm not creative and outgoing and interesting and all that. I just think there are basic deterministic processes to existing as a human being that can basically be simplified to \"social=good\". And you wonder why people have small talk? Just apply this principle to all of human life and you will see it's utility.\n\nSo, what am I going to do from here? Well, I have no choice. Keep texting my family and making friends and hanging out at band practice and talking with folks online. There's no other option, being social is my future, it's never going to go away. And that's going to be your future as well, we are chained to being social, you might as well accept it.\n\nI kind of want to scream and cry over this revelation that we are chained to positivity, but I've mostly accepted it. It explains so much about how people operate, why people laugh and sing and make small talk and joke. We are slaves to being happy. Is there not something kind of horrifying about that? No wonder I was a cynical kid who listened to Radiohead. I thought my sadness made me unique. Of course, I couldn't stay there forever, and the isolation was crippling. But it was better to be a cripple than a robot, that was my view. Well, I was a robot then as well, just a less happy one. ",
        "score": 3,
        "comments": []
    },
    {
        "id": "q72jme",
        "title": "Vaccinated, therefore",
        "author": "64ts29x5",
        "created_utc": "2021-10-13 05:27:41",
        "body": "C.O.V.I.D...\n\nOh COVID you're so fine, you're so fine you blow my mind, hey COVID!\n\nGuess whose my favourite Roman writer...you guessed it...c-OVID! ha ha ha ha ha ha\n\nQuarantine...r, I hardly knew 'er!\n\nWhy did the chicken cross the road? It wasn't self-isolating! A-hyuk-hyuk-hyuk\n\nFuck the Amish, I bet they are anti-vaxx\n\nI'm gonna vax-maxx\n\nSo here's the scoop\n\nYou are an intelligent ape...yes, yes, you heard me right...an ape\n\nBut an ape, and hear me out, is a very advanced form of a lizard\n\nSo it's all uh...connected. YOu see, in a spiritual way\n\nVery mystical\n\nYep, the monkeys are people-ish, and we are also like monkeys\n\nIt's very inspiring, it really makes you think about uh God and things of that nature\n\nIt's- and it make syou wonder, like...why do we do...things...and stuff?\n\nIt's all very, well I- that Darwin was a smart duck!\n\nSo, anyway we've settled on that, and so have I\n\nI've found knowledge hasn't really made me much richer\n\nKnowing philosophy surprisingly didn't make me hot\n\nBut then again I read about calories and weightloss and that seemed to help\n\nAnd I've read happiness studies, and so I spend more time with people\n\nIsolation makes you unhappy, remember that\n\nIsolation makes you unhappy\n\nOnce more, isolation makes you unhappy\n\nYou can't be happy and alone, so don't try it\n\nWe're meant to be around people, you can't help it\n\nWe literally are social robots\n\nFuck. \n\nSo even if you want to, you have to jabber with these other folk just to get some of that\n\nsweet sweet dopamine and seratonin\n\nGross, why can't I be the mystical man on the mountain?\n\nI bet that dude is unhappy\n\nFuck\n\nWell, time to \"nurture my relationships\"\n\nMy inner cringy emo teen hates himself\n\nOh well, I am a social robot, I better learn to do the robot\n\nGo make a friend, and send them a message, it'll make you happier, my chum, \n\nAnd remember to play nice, because niceness makes you feel good!\n\nFuck\n\nI'm constrained by my biology\n\nThe sophisticated ape-robot man spergs out on Reddit, \n\nhelplessly flailing his ego against the page\n\nHoping that someone can interject with knowledge, giving me more fulfillment tokens\n\n\"fitter, happier, more productive\"\n\nExcept not ironically\n\nLike Radiohead is literally like \n\n\"You should wash your pillows, and try not to smoke too much\" while sad strings plays\n\nWhat a joke\n\nNahh just kidding, you guys are geniuses\n\nSo, just read happiness studies if you want to be happy\n\nLuckily you don't need a shitload of money, just social relationships\n\nSo I have to be popular to be happy, kind of\n\nI have 6 really close people in my life\n\nIf I could get up to 15-20, I bet I'd be in social hyperspace\n\nTry to stop me, you asocial Radiohead-loving fucks\n\n(love you)\n\n[https://www.youtube.com/watch?v=O4SzvsMFaek&ab\\_channel=Radiohead-Topic](https://www.youtube.com/watch?v=O4SzvsMFaek&ab_channel=Radiohead-Topic)",
        "score": 2,
        "comments": []
    },
    {
        "id": "q6j4ho",
        "title": "[deleted by user]",
        "author": "deleted",
        "created_utc": "2021-10-12 12:27:10",
        "body": "[removed]",
        "score": 2,
        "comments": [
            {
                "id": "hgc6wqa",
                "parent_id": "q6j4ho",
                "author": "6l4z3",
                "created_utc": "2021-10-12 12:27:31",
                "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
                "score": 1
            }
        ]
    },
    {
        "id": "q6h29k",
        "title": "PIXSOLS AND ANTI SOCIAL ROBOT CLUB!",
        "author": "5c8c2m5q",
        "created_utc": "2021-10-12 09:52:34",
        "body": "1 . Pixsols , animated pixel art gifs, with customisable items , different backgrounds and loads of originality !\nMassive roadmap , and an even more massive and fun community! Minting goes live on 16th October ! \nJOIN THE BEST COMMUNITY IN NFTS B4 WE MOON!\n\nhttps://discord.gg/j5mRnJrTQy\n\n2. Antisocial Robot Club\nThis is the next axie infinity on Solana , 4 main robot base types with unique traits , items with stat boosts, clothing and apparel with stat boosts. Rarity depending on metal type and background. \nBattle arena in the making,  staking,  battling,  upgrading   and..... 3D BOTS COMIMG SOON.... the future is very bright with this ... JOIN THE ROBOT UPRISING!\n\nhttps://discord.gg/uQEkvTaVsu",
        "score": 1,
        "comments": []
    },
    {
        "id": "q4ohaz",
        "title": "A visit from a social robot improves hospitalized children’s outlook",
        "author": "2p162eu2",
        "created_utc": "2021-10-09 18:18:17",
        "body": "",
        "score": 1,
        "comments": []
    },
    {
        "id": "q3wi0z",
        "title": "A visit from a social robot improves hospitalized children’s outlook",
        "author": "wwj7h",
        "created_utc": "2021-10-08 14:13:33",
        "body": "",
        "score": 1,
        "comments": [
            {
                "id": "hfufxiz",
                "parent_id": "q3wi0z",
                "author": "6l4z3",
                "created_utc": "2021-10-08 14:13:34",
                "body": "This submission has been automatically removed because it appears to be from a mobile version of the site. Please delete and resubmit from the non-mobile site instead.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/technology) if you have any questions or concerns.*",
                "score": 1
            }
        ]
    },
    {
        "id": "q3sxjw",
        "title": "SOME EARLY PROJECTS WITH HUGE POTENTIAL",
        "author": "5c8c2m5q",
        "created_utc": "2021-10-08 09:36:12",
        "body": "I'll go first with a few good ones. It would be amazing if you could go join some of these and help support these brilliant communities !\n\nFirst of all here is Cardano Crocs lead by Mr Sean Benson on YouTube.  Very friendly community and good fun with a fantastic roadmap and utility. \n\nhttps://discord.gg/ZWWay2BYD9\n\nNext is Kups , a really cute little project with beautiful art, they have helped out 150 people that were rugged by solana towers , a must see! And very early days! \n\nhttps://discord.gg/GwDGQwBnBD\n\nThirdly is Solana Squirels this is an exciting one and it's got a huge roadmap ahead!!! You can breed your squirrels and also earn $NUT token. So plenty of utility again ! Also really nice artwork! \n\nhttps://discord.gg/PdhCfg5Q9c\n\nLast but not least is what I think will be the next Axie infinity on Solana and its called ANTI SOCIAL ROBOT CLUB .  All individual robots with 4 distinct classes with thier own strengths and stats , 3d versions coming soon , game in development,  battling in an arena for points , native token and multipliers based off how many bots you hold... a passive income dream! \n\nhttps://discord.gg/uQEkvTaVsu",
        "score": 3,
        "comments": [
            {
                "id": "hfu681f",
                "parent_id": "q3sxjw",
                "author": "a28kxwz1",
                "created_utc": "2021-10-08 12:17:52",
                "body": "Check out my latest SimpleSimon NFT collection here:\n\nFollow on Twitter: https://twitter.com/theSimonsNFT\n\nJoin Discord Community: https://discord.gg/UxdHDzfzx3",
                "score": 1
            }
        ]
    },
    {
        "id": "q0cpes",
        "title": "Anti Social robot lub special !",
        "author": "6b4oytvm",
        "created_utc": "2021-10-03 09:03:44",
        "body": "[removed]",
        "score": 1,
        "comments": [
            {
                "id": "hf74q6u",
                "parent_id": "q0cpes",
                "author": "6l4z3",
                "created_utc": "2021-10-03 09:03:44",
                "body": "Thank you for your submission on r/SolanaNFT, Join Solana NFT Marketplace Subreddits:\n\n- r/Solible\n- r/SolSeaNFT\n- r/Solanart\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SolanaNFT) if you have any questions or concerns.*",
                "score": 1
            }
        ]
    },
    {
        "id": "pp98da",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2021-09-16 10:24:02",
        "body": "Ingen Dynamics [Aido Robot](https://www.onfeetnation.com/profiles/blogs/aido-advanced-social-robot-for-smart-home-inspired-by-dolphins-1) \\- Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "pp8mmy",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2021-09-16 09:28:44",
        "body": "Ingen Dynamics [Aido Robot](https://papaly.com/categories/share?id=96fcc9d8e5bc458192c551422569bfe7) \\- Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "pp86i0",
        "title": "Self aware social robot pet can: answer questions, give fistbumps, self charge, dance to music it likes, climbs into your palm so it can go with you.",
        "author": "e52y0nrz",
        "created_utc": "2021-09-16 08:50:32",
        "body": "",
        "score": 57,
        "comments": [
            {
                "id": "hd22oly",
                "parent_id": "pp86i0",
                "author": "9lbabd2p",
                "created_utc": "2021-09-16 10:54:29",
                "body": "Awesome 👌",
                "score": 4
            },
            {
                "id": "hd2t7no",
                "parent_id": "pp86i0",
                "author": "3oab7mk9",
                "created_utc": "2021-09-16 15:44:06",
                "body": "What do you mean by „self-aware“ ?",
                "score": 4
            },
            {
                "id": "hd2cc7c",
                "parent_id": "pp86i0",
                "author": "7hqzvn69",
                "created_utc": "2021-09-16 13:10:33",
                "body": "Is that a cosmo?",
                "score": 3
            },
            {
                "id": "hd2rcut",
                "parent_id": "pp86i0",
                "author": "deleted",
                "created_utc": "2021-09-16 15:29:32",
                "body": "Those things are sentient",
                "score": 3
            },
            {
                "id": "hd3bzp0",
                "parent_id": "pp86i0",
                "author": "lag7v",
                "created_utc": "2021-09-16 17:53:16",
                "body": "This is incredible. How do I get one",
                "score": 3
            },
            {
                "id": "hd4pda8",
                "parent_id": "pp86i0",
                "author": "deleted",
                "created_utc": "2021-09-16 23:28:13",
                "body": "The future is now",
                "score": 3
            },
            {
                "id": "hd5magd",
                "parent_id": "pp86i0",
                "author": "6jnpv",
                "created_utc": "2021-09-17 03:46:38",
                "body": "It’s Vector",
                "score": 3
            },
            {
                "id": "hd2qm3b",
                "parent_id": "pp86i0",
                "author": "68t5apov",
                "created_utc": "2021-09-16 15:23:44",
                "body": "This is based on a spider, isn't it?",
                "score": 2
            },
            {
                "id": "hd4webj",
                "parent_id": "pp86i0",
                "author": "3ji7y7j9",
                "created_utc": "2021-09-17 00:20:09",
                "body": "It's so adorable",
                "score": 2
            },
            {
                "id": "hd5equr",
                "parent_id": "pp86i0",
                "author": "8639c6xr",
                "created_utc": "2021-09-17 02:47:31",
                "body": "How in the name of all that is cool did you learn to build this? These are the questions I need answered!",
                "score": 2
            },
            {
                "id": "hd5fl4l",
                "parent_id": "pp86i0",
                "author": "deleted",
                "created_utc": "2021-09-17 02:54:00",
                "body": "1/3 excavator\n\n1/3 loader\n\n1/3 computer mouse\n\n100% adorable",
                "score": 2
            },
            {
                "id": "hiipqu6",
                "parent_id": "pp86i0",
                "author": "85zm0lm4",
                "created_utc": "2021-10-29 16:55:22",
                "body": "Awe I have a vector too at work. Everybody loves s him if they come to my desk.",
                "score": 2
            },
            {
                "id": "hd4olqn",
                "parent_id": "hd2t7no",
                "author": "e52y0nrz",
                "created_utc": "2021-09-16 23:22:45",
                "body": "It makes its own choices. I can upload a video if you all would like.  Basically it explores on its own, it self charges, it doesn't get lost, and it recognizes you, and knows knows when there's obstacles in front of it as some examples.  Sometimes it decides to give you a fist bump even if you don't ask for one. It has many sensors so it doesn't fall off of a table and it knows when you pick it up.  It has AI image recognition so so it can detect your hands as well and interact with them. \n\nIt just can do a lot lol.",
                "score": 2
            },
            {
                "id": "hd9x0w2",
                "parent_id": "hd2cc7c",
                "author": "e52y0nrz",
                "created_utc": "2021-09-18 02:35:18",
                "body": "This is its newer sibling Vector",
                "score": 1
            },
            {
                "id": "hd5pdaf",
                "parent_id": "hd2rcut",
                "author": "deleted",
                "created_utc": "2021-09-17 04:11:01",
                "body": "Sentient robots inspired by heavy equipment (looks to be half-loader half-excavator with a bit of computer mouse) [rarely end up well](https://tfwiki.net/wiki/Constructicon_(G1\\)).",
                "score": 2
            },
            {
                "id": "hd5eeck",
                "parent_id": "hd2qm3b",
                "author": "deleted",
                "created_utc": "2021-09-17 02:44:45",
                "body": "Looks more like a construction vehicle.",
                "score": 2
            },
            {
                "id": "hd5fual",
                "parent_id": "hd5equr",
                "author": "deleted",
                "created_utc": "2021-09-17 02:56:02",
                "body": "S/he bought [it](https://www.digitaldreamlabs.com/).",
                "score": 2
            },
            {
                "id": "hd9zmu9",
                "parent_id": "hd5fl4l",
                "author": "e52y0nrz",
                "created_utc": "2021-09-18 02:57:12",
                "body": "😇",
                "score": 1
            },
            {
                "id": "hd4pff8",
                "parent_id": "hd4olqn",
                "author": "3oab7mk9",
                "created_utc": "2021-09-16 23:28:39",
                "body": "Thats really cool. The robot seems to have a „character“ that is convincing.\n\nI do not quite agree with the term „self aware“. For me this means, that the robot knows about his existence. „Autonomous“ would be a better adjective IMO. But maybe my sloppy english is messing with the way I think. (:\n\nedit: grammar",
                "score": 6
            },
            {
                "id": "hd4pup5",
                "parent_id": "hd4olqn",
                "author": "deleted",
                "created_utc": "2021-09-16 23:31:41",
                "body": "Aww. (My generation missed out on Transformers but I do find vehicle robots cute in a way)",
                "score": 3
            },
            {
                "id": "hd9zlgj",
                "parent_id": "hd5fual",
                "author": "e52y0nrz",
                "created_utc": "2021-09-18 02:56:53",
                "body": "100% right",
                "score": 1
            },
            {
                "id": "hda0g1g",
                "parent_id": "hd9zmu9",
                "author": "deleted",
                "created_utc": "2021-09-18 03:04:00",
                "body": "Who's an adorable little piece of heavy equipment? He is.",
                "score": 1
            },
            {
                "id": "hd9wz4i",
                "parent_id": "hd4pff8",
                "author": "e52y0nrz",
                "created_utc": "2021-09-18 02:34:53",
                "body": "Yeah you're not wrong 😄",
                "score": 1
            }
        ]
    },
    {
        "id": "pkzr19",
        "title": "[S] Guet Survivor: Lotery (season 62)",
        "author": "3gagt6a7",
        "created_utc": "2021-09-09 17:14:00",
        "body": "20 new people  selected by lottery go to the luck island for try to won 1 million of Dollars.\n\n&#x200B;\n\n**Cast**\n\n&#x200B;\n\n**(** u/bendoesit17): **Dave and SCM**\n\n**(** u/DashieProDX): **Bear Hugger**\n\n**(** u/fromthehouseofhallll): **Shouko Nishimiya and Smile**\n\n**(** u/Hi-Shinx): **Furletta Duchat**\n\n**(** u/Kingfin9391: **Kiibo and Salad Fingers**\n\n**(** u/Monado-Boii): **Dalia Matsuyama**\n\n**(** u/Mimikyu_Master2020): **Santa Litlle Helper and Token Black**\n\n**(** u/Mink1477): **Piet Pirat and Mokujin**\n\n**(** u/realityshowfan71102) **Martha \"Helen\" Lorraine and Patrick Star**\n\n**(** u/reddit-sux24): **Toxicroak and Nanokuma**\n\n**(** u/RikkiSnake): **Mailbox and Rachel**\n\n**(** u/roamingdutch): **Elmo**\n\n&#x200B;\n\n[Season 61](https://brantsteele.com/survivor/37/r.php?c=qyqzNxGE)\n\n&#x200B;\n\nMy toughts: >!two big pretty solid alliance on lead by Patrick and te second with Token, the end of pre-merge finish with the blinside of Patrick. The merge was pretty good but quicly diminate by the luck tribe final 4( Nanokuma, Kiibo, Helen and Shouko) who made some serious competition with Token black and Toxicroak who  become a great MVP villain on this season put he all 6 on the final. Token and Toxicorak have no chance and the last final 3 spot was a battle betewwen Kiibo and Shouko win by Kiibo ending the journey of fromthehouseofhal. The final 3 was pettry desrvinf with Helen (relityshowfan ) the challnege beast, Nanakuma (reddit-sux) the lietenant who become the tribe leader and Kiibo (kingfin) the social robot who won the firemaking challenge and go against 2 big shark. At the end the votes talk and the winner is Kiibo. gg kingfin for your victory here and tahnkeveryone to have play this season.!<\n\n&#x200B;\n\nAll-stars : Kiibo, Nanokuma, Helen, Shouko, ,Token,Toxicroak\n\nSecond chance : SCM, Patrick",
        "score": 2,
        "comments": [
            {
                "id": "hcabkgb",
                "parent_id": "pkzr19",
                "author": "61bs1qdx",
                "created_utc": "2021-09-10 09:38:21",
                "body": "I noticed Toxicroak and Suction Cup Man targeted each other quite a bit in early merge, so I made this.\n\nToxicroak: What the fuck are you doing?\n\nSCM: Voting for you, what does it look like?\n\nToxicroak: You can't put my name down!\n\nSCM: I'll put your name down all I want! Look at me go!",
                "score": 4
            },
            {
                "id": "hc73iuo",
                "parent_id": "pkzr19",
                "author": "858tiwjg",
                "created_utc": "2021-09-09 18:17:47",
                "body": "Kiibo won. This is cool",
                "score": 2
            },
            {
                "id": "hc7iczs",
                "parent_id": "pkzr19",
                "author": "dppaiyaq",
                "created_utc": "2021-09-09 20:00:13",
                "body": "Damn.. Shouko did so great! she had unbreakable relation ships with everyone in the top 4. if the made it to the finale she would have won!!1 im so sad rn",
                "score": 2
            },
            {
                "id": "hc6yppj",
                "parent_id": "pkzr19",
                "author": "7cpunx1w",
                "created_utc": "2021-09-09 17:44:29",
                "body": "Dang Santa’s Little Helper did awful but Token did pretty well",
                "score": 1
            }
        ]
    },
    {
        "id": "p8onpc",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2021-08-21 11:43:02",
        "body": "Ingen Dynamics [Aido Robot](http://www.helplinks.org/united-states/services/aido-robot) \\- Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "p6jnpp",
        "title": "Why do I not feel any euphoria on Adderall?",
        "author": "de0vp5ob",
        "created_utc": "2021-08-18 06:00:40",
        "body": "Diagnosed with ADHD combined type, but leaning more towards the hyperactive side; prescribed Adderall 10mg IR x2 a day.\n\nWhy do I never get \"amped up\" from Adderall or any of its amphetamine derivatives? My Adderall dose makes me really tired and annoyed that all I can do is focus on my work. It kills my otherwise hyperactive and outgoing personality, and turns me into a grumpy yet productive mess. I initially thought my dose was a little too low, but higher doses turn me into an anti-social robot.\n\nI was on Modafinil (off-label) for ADHD, and it got me really euphoric and energetic — making it the perfect drug for everyday interactions. Sure it doesn't come close to Adderall when it comes to helping with my focus for cognition-heavy tasks related to my work, but this makes me wonder why I never get any euphoria or burst of energy from Adderall that most people talk about. \n\nCould this be because I might have something like sleep apnea on the side with ADHD, and Adderall doesn't really help with sleep-related fatigue, but Modafinil does?",
        "score": 1,
        "comments": [
            {
                "id": "h9dirva",
                "parent_id": "p6jnpp",
                "author": "bazp64li",
                "created_utc": "2021-08-18 06:33:22",
                "body": "If you're chasing euphoria you're going to be in a world of hurt",
                "score": 9
            },
            {
                "id": "h9e2mid",
                "parent_id": "p6jnpp",
                "author": "xihes",
                "created_utc": "2021-08-18 11:16:21",
                "body": "Because you have ADHD. It's only speed for neurotypical people. One of ADHD's red flag symptoms is inverse reactions to stimulants. They literally put me to sleep.",
                "score": 6
            },
            {
                "id": "h9dk7rr",
                "parent_id": "p6jnpp",
                "author": "itco70f",
                "created_utc": "2021-08-18 06:50:01",
                "body": "IDK, why do diabetics not die after getting large enough doses if insulin to kill someone who isn't diabetic?",
                "score": 4
            },
            {
                "id": "h9dfq5f",
                "parent_id": "p6jnpp",
                "author": "6l4z3",
                "created_utc": "2021-08-18 06:00:50",
                "body": "Hi /u/swollen-scrotum and thanks for posting on /r/ADHD! If you haven't already, please take a minute to [read our rules](https://reddit.com/r/adhd/about/rules) and check out our list of official megathreads [here](https://www.reddit.com/r/ADHD/comments/nu534w/official_list_of_radhd_megathreads_please_check/). If your post fits into one of them, please resubmit your post as a reply to the relevant megathread instead. Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
                "score": 1
            },
            {
                "id": "h9djupd",
                "parent_id": "h9dirva",
                "author": "de0vp5ob",
                "created_utc": "2021-08-18 06:45:47",
                "body": "Not chasing it, just wondering why it never occurred to me",
                "score": 1
            }
        ]
    },
    {
        "id": "p44iod",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2021-08-14 10:50:06",
        "body": "[**Ingen Dynamics**](https://www.bitrated.com/aidorobot) Aido Robot - Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "p1om8z",
        "title": "Another study by Ilaria Torre and another technical problems?",
        "author": "deleted",
        "created_utc": "2021-08-10 14:55:59",
        "body": "[deleted]",
        "score": 1,
        "comments": []
    },
    {
        "id": "oyh5bq",
        "title": "[Academic] Social Robot Responses (18+)",
        "author": "805bhn49",
        "created_utc": "2021-08-05 15:06:13",
        "body": "[removed]",
        "score": 1,
        "comments": []
    },
    {
        "id": "oxq6gn",
        "title": "Social Robot Project",
        "author": "86265m2u",
        "created_utc": "2021-08-04 12:54:53",
        "body": "Hi im wondering something.Does Raspberry Pi  Pico have enough power to make a social robot like vector or cozmo from anki",
        "score": 2,
        "comments": [
            {
                "id": "h7of85i",
                "parent_id": "oxq6gn",
                "author": "8rkt6s9g",
                "created_utc": "2021-08-04 15:59:08",
                "body": "Just get a 4b 8gb and don’t worry about it. The pick barley runs a smart mirror fast enough. Not sure about the requirements fir social robot though so maybe",
                "score": 1
            }
        ]
    },
    {
        "id": "oxq3hl",
        "title": "Social Robot Project",
        "author": "86265m2u",
        "created_utc": "2021-08-04 12:49:16",
        "body": "[removed]",
        "score": 1,
        "comments": [
            {
                "id": "h7nvqr7",
                "parent_id": "oxq3hl",
                "author": "6l4z3",
                "created_utc": "2021-08-04 12:49:18",
                "body": "Please [click this link and go to the stickied helpdesk thread at the top of /r/raspberry_pi](https://old.reddit.com/r/raspberry_pi/about/sticky)† and ask your question there.\n\nIf you were trying to post a link use \"[Submit new content](https://www.reddit.com/r/raspberry_pi/submit)\", or if you're using *new* reddit, use the Link tab. If you were trying to post a picture, [use the Image & Video tab when posting](https://i.imgur.com/ncDvD4i.png).\n\n† If the link doesn't work it's because you're using a broken buggy mobile client. Please let the developer of your mobile client know they should fix their bug. In the meantime use a web browser in desktop mode instead.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/raspberry_pi) if you have any questions or concerns.*",
                "score": 1
            }
        ]
    },
    {
        "id": "ox0q5x",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2021-08-03 12:35:51",
        "body": "[**Ingen Dynamics**](https://www.launchora.com/story/alfio-tre-il-robot-che-al-gaslini-aiuta-i-bimbi-a) Aido Robot - Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.",
        "score": 1,
        "comments": []
    },
    {
        "id": "ooj00k",
        "title": "Aido Robot | Ingen Dynamics Aido Robot | Family Robot",
        "author": "86s8ma4c",
        "created_utc": "2021-07-21 06:44:48",
        "body": "Ingen Dynamics Aido Robot - Aido is the next generation social family robot. Smart, interactive, and uniquely mobile, Aido is the first social robot that can move around your home/office to help improve your lifestyle.\n\nMore Info Visit Here -: [**Arshad Hisham**](https://peatix.com/user/8252836/view)",
        "score": 1,
        "comments": []
    },
    {
        "id": "nxbu25",
        "title": "Hanson Robotics Launches Social Robot Prototype for Health Care",
        "author": "clhcfq1w",
        "created_utc": "2021-06-11 11:29:13",
        "body": "",
        "score": 1,
        "comments": [
            {
                "id": "h1duk9x",
                "parent_id": "nxbu25",
                "author": "6l4z3",
                "created_utc": "2021-06-11 11:29:15",
                "body": "Your submission has been automatically removed pending manual approval because your account does not meet the minimum karma or account age requirements of /r/worldnews for submitting from an uncommon domain. \n\nIf you are new to reddit, we suggest you read\n\n* [reddit 101](http://www.reddit.com/r/help/comments/2bx3cj/reddit_101/)\n\n* [How reddit works](http://www.redditblog.com/2014/07/how-reddit-works.html)\n\n* [The rules of /r/worldnews](http://www.reddit.com/r/worldnews/wiki/rules)\n\nYou may also want to review the [Reddit guidelines regarding spam](http://www.reddit.com/help/faq#Whatconstitutesspam) and the [wiki on self-promotion on reddit](http://www.reddit.com/wiki/selfpromotion). \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/worldnews) if you have any questions or concerns.*",
                "score": 1
            }
        ]
    }
]